of40/tutorials/rheoFoam/Aneurysm/HerschelBulkley/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    in1
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            zeroGradient;
        
    }

    "(out.*)"
    {
        type            fixedValue;
        value           uniform 0;
       
    }

   
}

// ************************************************************************* //
